const cities = [
  "68393af295ae501b2e6221a1", // Астана
  "68393af395ae501b2e6221a2", // Алматы
  "68393af495ae501b2e6221a3", // Шымкент
  "68393af495ae501b2e6221a4", // Караганда
  "68393af495ae501b2e6221a5", // Павлодар
  "68393af595ae501b2e6221a6", // Семей
  "68393af595ae501b2e6221a7", // Актобе
  "68393af595ae501b2e6221a8", // Тараз
  "68393af695ae501b2e6221a9", // Кызылорда
  "68393af695ae501b2e6221aa", // Усть-Каменогорск
  "68393af695ae501b2e6221ab", // Костанай
  "68393af795ae501b2e6221ac", // Атырау
  "68393af795ae501b2e6221ad", // Уральск
  "68393af795ae501b2e6221ae", // Кокшетау
  "68393af895ae501b2e6221af", // Талдыкорган
  "68393af895ae501b2e6221b0", // Петропавловск
  "68393af895ae501b2e6221b1", // Актау
  "68393af995ae501b2e6221b2", // Аркалык
  "68393af995ae501b2e6221b3", // Рудный
  "68393af995ae501b2e6221b4", // Темиртау
];

// Функция для случайного выбора 1-3 городов
function getRandomCities() {
  const count = Math.floor(Math.random() * 3) + 1;
  const shuffled = cities.sort(() => 0.5 - Math.random());
  return shuffled.slice(0, count);
}

// Пример одной специальности с добавленными университетами (городами)
const specialtiesWithUniversities = [
  {
    code: "B001",
    name: "Педагогика и психология",
    ent_subjects: ["Биология", "География"],
  },
  {
    code: "B002",
    name: "Дошкольное обучение и воспитание",
    ent_subjects: ["Биология", "География"],
  },
  {
    code: "B003",
    name: "Педагогика и методика начального обучения",
    ent_subjects: ["Биология", "География"],
  },
  {
    code: "B004",
    name: "Подготовка учителей начальной военной подготовки",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B005",
    name: "Подготовка учителей физической культуры",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B006",
    name: "Подготовка учителей музыки",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B007",
    name: "Подготовка учителей художественного труда и черчения",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B008",
    name: "Подготовка учителей основы права и экономики",
    ent_subjects: ["Всемирная история", "География"],
  },
  {
    code: "B009",
    name: "Подготовка учителей математики",
    ent_subjects: ["Математика", "Физика"],
  },
  {
    code: "B010",
    name: "Подготовка учителей физики",
    ent_subjects: ["Математика", "Физика"],
  },
  {
    code: "B011",
    name: "Подготовка учителей информатики",
    ent_subjects: ["Математика", "Информатика"],
  },
  {
    code: "B012",
    name: "Подготовка учителей химии",
    ent_subjects: ["Химия", "Биология"],
  },
  {
    code: "B013",
    name: "Подготовка учителей биологии",
    ent_subjects: ["Биология", "География"],
  },
  {
    code: "B014",
    name: "Подготовка учителей географии",
    ent_subjects: ["География", "Всемирная история"],
  },
  {
    code: "B015",
    name: "Подготовка учителей по гуманитарным предметам",
    ent_subjects: ["Всемирная история", "География"],
  },
  {
    code: "B016",
    name: "Подготовка учителей казахского языка и литературы",
    ent_subjects: ["Казахский язык", "Казахская литература"],
  },
  {
    code: "B017",
    name: "Подготовка учителей русского языка и литературы",
    ent_subjects: ["Русский язык", "Русская литература"],
  },
  {
    code: "B018",
    name: "Подготовка учителей иностранного языка",
    ent_subjects: ["Иностранный язык", "Всемирная история"],
  },
  {
    code: "B019",
    name: "Подготовка социальных педагогов",
    ent_subjects: ["Биология", "География"],
  },
  {
    code: "B020",
    name: "Специальная педагогика",
    ent_subjects: ["Биология", "География"],
  },
  {
    code: "B021",
    name: "Исполнительское искусство",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B022",
    name: "Музыковедение",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B023",
    name: "Режиссура, арт-менеджмент",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B024",
    name: "Искусствоведение",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B025",
    name: "Дирижирование",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B026",
    name: "Композиция",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B027",
    name: "Театральное искусство",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B028",
    name: "Хореография",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B029",
    name: "Аудиовизуальные средства и медиа производство",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B030",
    name: "Изобразительное искусство",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B031",
    name: "Мода, дизайн",
    ent_subjects: ["Творческий экзамен", "Творческий экзамен"],
  },
  {
    code: "B032",
    name: "Философия и этика",
    ent_subjects: ["Всемирная история", "География"],
  },
  {
    code: "B033",
    name: "Религия и теология",
    ent_subjects: ["Творческий экзамен", "История Казахстана"],
  },
  {
    code: "B034",
    name: "История",
    ent_subjects: ["История Казахстана", "Всемирная история"],
  },
  {
    code: "B035",
    name: "Тюркология",
    ent_subjects: ["Казахский язык", "Всемирная история"],
  },
  {
    code: "B036",
    name: "Переводческое дело",
    ent_subjects: ["Казахский язык", "Иностранный язык"],
  },
  {
    code: "B037",
    name: "Филология",
    ent_subjects: ["Казахский язык", "Казахская литература"],
  },
  {
    code: "B038",
    name: "Социология",
    ent_subjects: ["История Казахстана", "Основы социально-гуманитарных наук"],
  },
  {
    code: "B039",
    name: "Культурология",
    ent_subjects: [
      "История Казахстана",
      "Организация работы социальных учреждений",
    ],
  },
  {
    code: "B040",
    name: "Политология",
    ent_subjects: ["История Казахстана", "Основы социально-гуманитарных наук"],
  },
  {
    code: "B041",
    name: "Психология",
    ent_subjects: ["История Казахстана", "Основы психологии"],
  },
  {
    code: "B042",
    name: "Журналистика и репортерское дело",
    ent_subjects: ["Творческий экзамен", "Казахский язык"],
  },
  {
    code: "B043",
    name: "Библиотечное дело, обработка информации и архивное дело",
    ent_subjects: ["Казахский язык", "Организация делопроизводства"],
  },
  {
    code: "B044",
    name: "Менеджмент и управление",
    ent_subjects: ["Основы экономики", "Менеджмент"],
  },
  {
    code: "B045",
    name: "Аудит и налогообложение",
    ent_subjects: ["Финансы и кредит", "Экономика организации"],
  },
];

const updatedSpecialties = specialtiesWithUniversities.map((specialty) => ({
  ...specialty,
  universities: getRandomCities(),
}));

console.log(updatedSpecialties);
